export default function UserPolicy() {
  return (
    <div className="overflow-scroll font-montserrat text-base max-w-4xl mx-auto bg-white text-black p-2 lg:p-10 rounded-md">
      <h1 className="text-xl font-bold mb-6">
        ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ ПО РАБОТЕ С ПЕРСОНАЛЬНЫМИ ДАННЫМИ
        ПОЛЬЗОВАТЕЛЕЙ
      </h1>

      <h2 className="text-xl font-semibold mt-8 mb-4">
        1. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ
      </h2>
      <p className=" text-sm mb-4">• March 30 at 4:52 PM</p>

      <p className=" text-sm mb-3">
        <b>Персональные данные</b> - любая информация, относящаяся к
        определенному или определяемому на основании такой информации
        физическому лицу (субъекту персональных данных). Т.е. к такой
        информации, в частности, можно отнести любую предоставленную
        пользователем информацию: фамилия, имя, отчество, номер телефона,
        электронная почта, а также другую информацию.
      </p>

      <p className=" text-sm mb-3">
        <b>Обработка персональных данных</b> – любое действие (операция) или
        совокупность действий (операций), совершаемых с использованием средств
        автоматизации или без использования таких средств с персональными
        данными, включая сбор, запись, систематизацию, накопление, хранение,
        уточнение (обновление, изменение), извлечение, использование, передачу
        (распространение, предоставление, доступ), обезличивание, блокирование,
        удаление, уничтожение персональных данных. При этом передача
        осуществляется в соответствии с законными предписаниями уполномоченных
        органов или в соответствии с условиями договора, при подписании которого
        Пользователь дает свое согласие на такую обработку.
      </p>

      <p className=" text-sm mb-3">
        <b>Конфиденциальность персональных данных</b> - обязательное для
        соблюдения допущенными к обработке персональных данных пользователей
        требование надлежаще соблюдать правила их обработки, хранения, не
        допускать их распространения без согласия субъекта или иного законного
        основания, а также обеспечение
      </p>

      <p className=" text-sm mb-3">
        <b>Использование персональных данных</b> - действия (операции) с
        персональными данными, направленные на идентификацию Пользователя с
        целью предоставления доступа к сервису и получение подтверждения
        достоверности указанной Пользователем информации.
      </p>

      <p className=" text-sm mb-3">
        <b>Информация</b> - сведения (сообщения, данные) независимо от формы их
        представления.
      </p>

      <p className=" text-sm mb-3">
        <b>Общедоступные персональные данные</b> - персональные данные, доступ
        неограниченного круга лиц к которым предоставлен с согласия субъекта или
        на которые в соответствии с федеральными законами не распространяется
        требование соблюдения конфиденциальности.
      </p>

      <p className=" text-sm mb-3">
        <b>Оператор</b> - Компания, осуществляющая обработку персональных данных
        пользователей в целях предоставления последним авторизованного доступа
        ко всем сервисам, а также определяющая цели обработки персональных
        данных, состав персональных данных, действия (операции), совершаемые с
        персональными данными, порядок хранения и уничтожения персональных
        данных пользователей.
      </p>

      <p className=" text-sm mb-3">
        <b>Пользователь</b> - посетитель сервиса.
      </p>

      <p className=" text-sm mb-3">
        <b>Распространение персональных данных</b> – любые действия,
        направленные на раскрытие персональных данных неопределенному кругу лиц
        (передача персональных данных) или на ознакомление с персональными
        данными неограниченного круга лиц, в том числе обнародование
        персональных данных в средствах массовой информации, размещение в
        информационно-телекоммуникационных сетях или предоставление доступа к
        персональным данным каким-либо иным способом.
      </p>

      <p className=" text-sm mb-6">
        <b>Уничтожение персональных данных</b> – любые действия, в результате
        которых персональные данные уничтожаются безвозвратно с невозможностью
        дальнейшего восстановления содержания персональных данных в
        информационной системе персональных данных и (или) уничтожаются
        материальные носители персональных данных.
      </p>

      {/* --- Раздел 2 --- */}
      <h2 className="text-xl font-semibold mt-8 mb-4">
        2. ПРАВА И ОБЯЗАННОСТИ
      </h2>
      <h3 className="text-lg font-semibold mt-6 mb-2">
        2.1. Оператор имеет право:
      </h3>
      <ul className="list-disc pl-6 mb-3 space-y-1">
        <li>
          <b>2.1.1.</b> Получать от субъекта персональных данных достоверные
          информацию и/или документы, содержащие персональные данные;
        </li>
        <li>
          <b>2.1.2.</b> В случае отзыва субъектом персональных данных согласия
          на обработку персональных данных Оператор вправе продолжить обработку
          персональных данных без согласия субъекта персональных данных при
          наличии оснований, указанных в Законе о персональных данных;
        </li>
        <li>
          <b>2.1.3.</b> Самостоятельно определять состав и перечень мер,
          необходимых и достаточных для обеспечения выполнения обязанностей,
          предусмотренных Законом о персональных данных и принятыми в
          соответствии с ним нормативными правовыми актами, если иное не
          предусмотрено Законом о персональных данных или другими федеральными
          законами.
        </li>
      </ul>

      <h3 className="text-lg font-semibold mt-6 mb-2">2.2. Оператор обязан:</h3>
      <ul className="list-disc pl-6 mb-3 space-y-1">
        <li>
          <b>2.2.1.</b> Организовывать обработку персональных данных в порядке,
          установленном действующим законодательством РФ;
        </li>
        <li>
          <b>2.2.2.</b> Отвечать на обращения и запросы субъектов персональных
          данных и их законных представителей в соответствии с требованиями
          Закона о персональных данных;
        </li>
        <li>
          <b>2.2.3.</b> Прекратить передачу (распространение, предоставление,
          доступ) персональных данных, прекратить обработку и уничтожить
          персональные данные в порядке и случаях, предусмотренных Законом о
          персональных данных;
        </li>
      </ul>

      <h3 className="text-lg font-semibold mt-6 mb-2">
        2.3. Субъекты персональных данных имеют право:
      </h3>
      <ul className="list-disc pl-6 mb-3 space-y-1">
        <li>
          <b>2.3.1.</b> Получать информацию, касающуюся обработки персональных
          данных субъекта, за исключением случаев, предусмотренных федеральными
          законами.
        </li>
        <li>
          <b>2.3.2.</b> Требовать от оператора уточнения его персональных
          данных, их блокирования или уничтожения в случае, если персональные
          данные являются неполными, устаревшими, неточными, незаконно
          полученными или не являются необходимыми для заявленной цели
          обработки, а также принимать предусмотренные законом меры по защите
          своих прав;
        </li>
      </ul>

      <h3 className="text-lg font-semibold mt-6 mb-2">
        2.4. Субъекты персональных данных обязаны:
      </h3>
      <ul className="list-disc pl-6 mb-6 space-y-1">
        <li>
          <b>2.4.1.</b> Предоставлять Оператору достоверные данные о себе;
        </li>
        <li>
          <b>2.4.2.</b> Сообщать Оператору об уточнении (обновлении, изменении)
          своих персональных данных.
        </li>
      </ul>

      {/* --- Раздел 3 --- */}
      <h2 className="text-xl font-semibold mt-8 mb-4">
        3. ПРИНЦИПЫ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ
      </h2>
      <p className=" text-sm mb-3">
        <b>3.1.</b> Обработка персональных данных осуществляется на законной и
        справедливой основе.
      </p>
      <p className=" text-sm mb-3">
        <b>3.2.</b> Обработка персональных данных ограничивается достижением
        конкретных, заранее определенных и законных целей. Не допускается
        обработка персональных данных, несовместимая с целями сбора персональных
        данных.
      </p>
      <p className=" text-sm mb-3">
        <b>3.3.</b> Не допускается объединение баз данных, содержащих
        персональные данные, обработка которых осуществляется в целях,
        несовместимых между собой.
      </p>
      <p className=" text-sm mb-3">
        <b>3.4.</b> Обработке подлежат только персональные данные, которые
        отвечают целям их обработки.
      </p>
      <p className=" text-sm mb-3">
        <b>3.5.</b>Содержание и объем обрабатываемых персональных данных
        соответствуют заявленным целям обработки. Не допускается избыточность
        обрабатываемых персональных данных по отношению к заявленным целям их
        обработки.
      </p>
      <p className=" text-sm mb-3">
        <b>3.6.</b> При обработке персональных данных обеспечивается точность
        персональных данных, их достаточность, а в необходимых случаях и
        актуальность по отношению к целям обработки персональных данных.
        Оператор принимает необходимые меры и/или обеспечивает их принятие по
        удалению или уточнению неполных или неточных данных.
      </p>
      <p className=" text-sm mb-6">
        <b>3.7.</b> Хранение персональных данных осуществляется в форме,
        позволяющей определить субъекта персональных данных, не дольше, чем
        этого требуют цели обработки персональных данных, если срок хранения
        персональных данных не установлен федеральным законом, договором,
        стороной которого, выгодоприобретателем или поручителем по которому
        является субъект персональных данных. Обрабатываемые персональные данные
        уничтожаются либо обезличиваются по достижении целей обработки или в
        случае утраты необходимости в достижении этих целей, если иное не
        предусмотрено федеральным законом.
      </p>

      {/* --- Раздел 4 --- */}
      <h2 className="text-xl font-semibold mt-8 mb-4">
        4. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ
      </h2>
      <p className=" text-sm mb-3">
        <b>4.1.</b> Цель обработки персональных данных Пользователя:
      </p>
      <ul className="list-disc pl-6 mb-3 space-y-1">
        <li>
          <b>4.1.1.</b> Информирование Пользователя;
        </li>
        <li>
          <b>4.1.2.</b> Предоставление доступа Пользователю к сервису;
        </li>
      </ul>
      <p className=" text-sm mb-6">
        <b>4.2.</b> Оператор имеет право направлять Пользователю уведомления о
        новых продуктах и услугах, специальных предложениях и различных
        событиях. Пользователь всегда может отказаться от получения
        информационных сообщений, направив Оператору письмо на{" "}
        <b>Адрес электронной почты</b>.
      </p>

      {/* --- Раздел 5 --- */}
      <h2 className="text-xl font-semibold mt-8 mb-4">
        5. КОНФИДЕНЦИАЛЬНОСТЬ ПЕРСОНАЛЬНЫХ ДАННЫХ
      </h2>
      <p className=" text-sm mb-6">
        <b>5.1.</b> Оператор и иные лица, получившие доступ к персональным
        данным, обязаны не раскрывать третьим лицам и не распространять
        персональные данные без согласия субъекта персональных данных, если иное
        не предусмотрено федеральным законом.
      </p>

      {/* --- Раздел 6 --- */}
      <h2 className="text-xl font-semibold mt-8 mb-4">
        6. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ
      </h2>
      <p className=" text-sm mb-3">
        <b>6.1.</b> Пользователь может получить любые разъяснения по
        интересующим вопросам, касающимся обработки его персональных данных,
        обратившись к Оператору с помощью <b>электронной почты</b>.
      </p>
      <p className=" text-sm mb-6">
        <b>6.2.</b> В данном документе будут отражены любые изменения политики
        обработки персональных данных Оператором. Политика действует бессрочно
        до замены ее новой версией.
      </p>
    </div>
  );
}
