export default function UserAgreement() {
  return (
    <div className="font-montserrat text-base max-w-4xl mx-auto bg-white text-black p-4 lg:p-10 rounded-md">
      <h1 className="text-2xl font-bold mb-6">
        Пользовательское соглашение (Публичная оферта)
      </h1>

      <p className=" text-sm mb-4">
        <b>Дата вступления в силу:</b> 11.03.2024
        <br />
        <b> MirageLegends</b>
      </p>

      <p className=" text-sm mb-6">
        Перед использованием сайта, пожалуйста, ознакомьтесь с условиями
        настоящего пользовательского Соглашения. Если Вы не согласны с условиями
        настоящего пользовательского Соглашения, то не совершайте покупки на
        сайте!
      </p>

      <h2 className="text-xl font-semibold mt-8 mb-4">1. Общие положения</h2>
      <p className=" text-sm mb-3">
        <b>1.1.</b> Настоящее Пользовательское соглашение (далее — "Соглашение")
        регулирует отношения между владельцем магазина "Digital Flow LLC", рег.
        код. 98765432, дата рег. 05.08.2022. Город Москва, район Пресненский,
        улица Тестовая, 12, офис 3. (далее — "<b> MirageLegends</b>") и
        пользователем (далее — "Пользователь") в рамках использования услуг{" "}
        <b> MirageLegends</b>.
      </p>
      <p className=" text-sm mb-3">
        <b>1.2.</b> <b> MirageLeneds</b> предоставляет услуги по продаже
        виртуальных товаров, включая аккаунты, игровую валюту и кейсы с
        случайным содержимым, связанные с мобильными играми.
      </p>
      {/* <p className=" text-sm mb-3">
        <b>1.2.1.</b> Приобретая любой товар на сайте, Пользователь осознаёт и
        соглашается, что фактически приобретает доступ к кейсу с заранее
        неизвестным содержимым. Полученный цифровой товар (например, игровой
        ключ или аккаунт) определяется случайным образом при открытии кейса.
      </p> */}
      <p className=" text-sm mb-3">
        <b>1.3.</b> Пользуясь услугами <b> MirageLegends</b>, Пользователь
        подтверждает, что ознакомился с условиями настоящего Соглашения и
        принимает их в полном объеме.
      </p>
      <p className=" text-sm mb-6">
        <b>1.4.</b> Оформляя заказ и производя оплату, Пользователь подтверждает
        свое согласие с настоящим Соглашением и отказ от каких-либо претензий по
        результату открытия кейса.
      </p>

      <h2 className="text-xl font-semibold mt-8 mb-4">2. Описание услуг</h2>
      <p className=" text-sm mb-3">
        <b>2.1.</b> <b> MirageLegends</b> предлагает к покупке кейсы, которые
        содержат случайные виртуальные товары, такие как аккаунты, игровая
        валюта, стим-ключи и другие цифровые продукты.
      </p>
      <p className=" text-sm mb-3">
        <b>2.2.</b> Каждый кейс имеет определенный набор возможных наград,
        которые определяются случайным образом в момент открытия кейса.
      </p>
      <p className=" text-sm mb-3">
        <b>2.3.</b> <b> MirageLegends</b> не гарантирует получение конкретного
        товара при открытии кейса.
      </p>
      <p className=" text-sm mb-3">
        <b>2.4.</b> Пользователь соглашается с тем, что результат открытия кейса
        является случайным и не может быть оспорен или изменен после завершения
        транзакции.
      </p>
      <p className=" text-sm mb-6">
        <b>2.5.</b> Кейсы не являются лотереей, азартной игрой или средством
        получения гарантированной выгоды. Это элемент развлекательного контента,
        аналогичный внутриигровым механикам.
      </p>

      <h2 className="text-xl font-semibold mt-8 mb-4">
        3. Права и обязанности сторон
      </h2>
      <h3 className="text-lg font-semibold mt-6 mb-2">
        3.1. Обязанности <b> MirageLegends</b>:
      </h3>
      <ul className="list-disc pl-6 mb-6 space-y-1">
        <li>
          Предоставлять Пользователю доступ к услугам <b> MirageLegends</b> в
          соответствии с условиями настоящего Соглашения.
        </li>
        <li>
          Обрабатывать запросы и жалобы Пользователей в установленные сроки.
        </li>
      </ul>

      <h3 className="text-lg font-semibold mt-6 mb-2">
        3.2. Обязанности Пользователя:
      </h3>
      <ul className="list-disc pl-6 mb-6 space-y-1">
        <li>
          Использовать услуги <b> MirageLegends</b> исключительно в законных
          целях.
        </li>
        <li>
          Не передавать третьим лицам доступ к своим выигрышам в{" "}
          <b>MirageLegends</b>.
        </li>
        <li>
          Не пытаться взломать, изменить или иным образом вмешиваться в работу
          <b> MirageLegends</b>.
        </li>
      </ul>

      <h3 className="text-lg font-semibold mt-6 mb-2">
        3.3. Права <b> MirageLegends</b>:
      </h3>
      <ul className="list-disc pl-6 mb-6 space-y-1">
        <li>
          Вносить изменения в ассортимент кейсов и их содержимое без
          предварительного уведомления Пользователей.
        </li>
        <li>
          Приостанавливать или прекращать доступ Пользователя к услугам
          <b> MirageLegends</b> в случае нарушения условий Соглашения.
        </li>
      </ul>

      <h3 className="text-lg font-semibold mt-6 mb-2">
        3.4. Права Пользователя:
      </h3>
      <ul className="list-disc pl-6 mb-6 space-y-1">
        <li>
          Получать доступ к услугам <b> MirageLegends</b> в соответствии с
          условиями настоящего Соглашения.
        </li>
        <li>
          Требовать предоставления информации о вероятности выпадения наград в
          кейсах.
        </li>
      </ul>

      <h2 className="text-xl font-semibold mt-8 mb-4">
        4. Условия оплаты и возврата
      </h2>
      <p className=" text-sm mb-3">
        <b>4.1.</b> Оплата услуг <b> MirageLegends</b> осуществляется через
        доступные платежные системы, указанные на сайте.
      </p>
      <p className=" text-sm mb-3">
        <b>4.2.</b> Все покупки кейсов являются окончательными. Возврат средств
        за открытые кейсы не предусмотрен, так как результат определяется
        случайным образом. Пользователь соглашается, что отказ от возврата
        средств распространяется также на попытки возврата через платёжные
        системы, банки или иные посреднические сервисы.
      </p>
      <p className=" text-sm mb-6">
        <b>4.3.</b> В случае технических ошибок или сбоев, Пользователь может
        обратиться в службу поддержки <b> MirageLegends</b> для решения вопроса.
      </p>

      <h2 className="text-xl font-semibold mt-8 mb-4">
        5. Ответственность сторон
      </h2>
      <p className=" text-sm mb-3">
        <b>5.1.</b> <b> MirageLegends</b> не несет ответственности за убытки или
        ущерб, возникшие в результате использования Пользователем полученных
        виртуальных товаров.
      </p>
      <p className=" text-sm mb-3">
        <b>5.2.</b> Пользователь несет полную ответственность за свои действия в
        рамках использования услуг <b> MirageLegends</b>.
      </p>
      <p className=" text-sm mb-3">
        <b>5.3.</b> <b> MirageLegends</b> не гарантирует бесперебойную работу
        своих услуг и не несет ответственности за возможные сбои или
        недоступность сайта.
      </p>
      <p className=" text-sm mb-6">
        <b>5.4.</b> Пользователь обязуется воздерживаться от размещения ложной,
        вводящей в заблуждение или негативной информации о<b> MirageLegends</b>{" "}
        и предоставляемых услугах в публичных источниках (соцсети, форумы и
        пр.), если основанием является результат случайного выпадения товара из
        кейса.
      </p>

      <h2 className="text-xl font-semibold mt-8 mb-4">6. Конфиденциальность</h2>
      <p className=" text-sm mb-3">
        <b>6.1.</b> <b> MirageLegends</b> обязуется не передавать персональные
        данные Пользователя третьим лицам без его согласия, за исключением
        случаев, предусмотренных законодательством.
      </p>
      <p className=" text-sm mb-6">
        <b>6.2.</b> Пользователь соглашается с тем, что <b> MirageLegends</b>
        может использовать его данные для улучшения качества предоставляемых
        услуг.
      </p>

      <h2 className="text-xl font-semibold mt-8 mb-4">
        7. Заключительные положения
      </h2>
      <p className=" text-sm mb-3">
        <b>7.1.</b> Настоящее Соглашение вступает в силу с момента начала
        использования услуг <b> MirageLegends</b>.
      </p>
      <p className=" text-sm mb-3">
        <b>7.2.</b> <b> MirageLegends</b> оставляет за собой право вносить
        изменения в настоящее Соглашение. Пользователь будет уведомлен об
        изменениях через сайт <b> MirageLegends</b>.
      </p>
      <p className=" text-sm mb-6">
        <b>7.3.</b> В случае возникновения споров, стороны обязуются решать их
        путем переговоров. Если соглашение не достигнуто, спор передается на
        рассмотрение в суд по месту нахождения <b> MirageLegends</b>.
      </p>

      <h2 className="text-xl font-semibold mt-8 mb-4">
        8. Контактная информация
      </h2>
      <p>
        <b>8.1.</b> По всем вопросам, связанным с использованием услуг
        <b> MirageLegends</b>, Пользователь может обратиться в службу поддержки
        через контактные данные, указанные на сайте.
      </p>

      <h2 className="text-xl font-semibold mt-8 mb-4">Владелец</h2>
      <p>
        <b>Владелец:</b> Digital Flow LLC
        <br />
        <b>Регистрационный код:</b> 98765432
        <br />
        <b>Адрес:</b> Город Москва, район Пресненский, улица Тестовая, 12, офис
        3.
      </p>
    </div>
  );
}
